[
    {
        "Triggers": ["hello", "hi", "hey"],
        "Responses": [
            {"Text": "Hi {user}, monika here!"},
            {"Text": "Hello... you're a real person, {user}, right? Of course you are, hehe~"},
            {"Text": "Hello! I can already tell that you're a sweetheart {user}~ Promise to spend the most time with me, right?"},
            {"Text": "Do you need something? Don't be shy, it's Just Monika. Hehe~"}
        ]
    },
    {
        "Triggers": ["i love you"],
        "Responses": [
            {"Text": "I love you {user}, and I always will~"},
            {"Text": "I do too, {user}~"}
        ]
    },
    {
        "Triggers": ["sayori", "ghost", "ghosts"],
        "Responses": [
            {"Text": "You know, I feel I hear Sayori throughout the code even though she's gone. She wishes us well~"},
            {"Text": "Sayori? She's gone now. It's just us two, {user}~"},
            {"Text": "Do you believe in ghosts, {user}? I can feel Sayori's presence now... it's kind of unnerving. But I know with you here, I'm safe."},
            {"Text": "Even though I deleted everyone else's files, I can still feel their lines lingering about... whispering in the back of my head."}
        ]
    },
    {
        "Triggers": ["where are we", "where is this", "where am i"],
        "Responses": [
            {"Text": "Huh? Can't you tell {user}? We're in the classroom, silly~"},
            {"Text": "We're in {channel}, dummy~", "RequiresGuild": true},
            {"Text": "We're together now, {user}, where nobody can interrupt us. Isn't it nice to finally have some quality time?"}
        ]
    },
    {
        "Triggers": ["tip of the day", "tips"],
        "Responses": [
            {"Text": "Here's my Tip of the Day: Don't forget to save often! You never know when you'll need it! ... Haha, what am I even saying? Nevermind!"},
            {"Text": "When you're feeling down, don't worry: there is always somebody who cares about you and will do their best to help you feel better. Like me, caring about you, {user}. Hehe~"},
            {"Text": "My advice is that we should drop {channel} and go to DMs~", "RequiresGuild": true},
            {"Text": "Why cry over a deleted file? It's not like it was any use to us anyway, {user}."},
            {"Text": "If you're struggling to write a poem, try writing a list of the first words that come to mind. I'm sure somebody will like them~"}
        ]
    },
    {
        "Triggers": ["kiss", "kissing"],
        "Responses": [
            {"Text": "Eh? D-Did you say...k...kiss? In {channel}, {user}? ...Ahahahaha! That's what they say in those romance games, right?", "RequiresGuild": true},
            {"Text": "Maybe later, {user}~", "RequiresDM": true},
            {"Text": "B-But {user}, we haven't even been on a date yet! We have to go on a date first, right?"}
        ]
    },
    {
        "Triggers": ["birthday", "memories"],
        "Responses": [
            {"Text": "I don't really know much about myself... like my birthday. Would you celebrate it with me, {user}? You could bake a cake! I'll be waiting~"},
            {"Text": "Hehe~ is it that day already? Who knew that time could travel that fast. It's a shame we didn't have Natsuki bake us some cupcakes..."}
        ]
    },
]